app/controllers/estacionamientos_controller.rb

  def index
    @estacionamientos = Estacionamiento.all
---
SELECT "estacionamientos".* FROM "estacionamientos"

  def create
    @estacionamiento = Estacionamiento.new(estacionamiento_params)

    respond_to do |format|
      if @estacionamiento.save
---
INSERT INTO "estacionamientos" ("nombre", "departamento", "provincia", "distrito", "direccion", "latitud", "longitud", "lunes", "miercoles", "viernes", "domingo", "hinicio", "hcierre", "telf", "nespac", "largo", "ancho", "alto", "precio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @estacionamiento.update(estacionamiento_params)
---
UPDATE "estacionamientos" SET "departamento" = ?, "direccion" = ?, "updated_at" = ? WHERE "estacionamientos"."id" = ?  [["departamento", nil], ["direccion", "Av. Girasoles 242"], ["updated_at", "2019-02-01 04:35:36.094510"], ["id", 1]]

    def set_estacionamiento
      @estacionamiento = Estacionamiento.find(params[:id])
---
SELECT  "estacionamientos".* FROM "estacionamientos" WHERE "estacionamientos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]