app/controllers/serv_adicinales_controller.rb

SELECT "serv_adicinales".* FROM "serv_adicinales"
---
  def index
    @serv_adicinales = ServAdicinale.all

INSERT INTO "serv_adicinales" ("nombre", "precio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "Lavado"], ["precio", 20.0], ["created_at", "2019-02-03 05:09:29.262127"], ["updated_at", "2019-02-03 05:09:29.262127"]]
---
  def create
    @serv_adicinale = ServAdicinale.new(serv_adicinale_params)

    respond_to do |format|
      if @serv_adicinale.save

SELECT  "serv_adicinales".* FROM "serv_adicinales" WHERE "serv_adicinales"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_serv_adicinale
      @serv_adicinale = ServAdicinale.find(params[:id])