app/controllers/usuario_controller.rb

  def PrincipalDue
     @estacionamientos = Estacionamiento.all
---
SELECT "estacionamientos".* FROM "estacionamientos"